Repository: luxzip/jctool-winui
Catalog: jctool-winui/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppTitle.Text
source: Joy-Con Toolkit
zh_cn: Joy-Con 工具箱

# WindowTitle
source: Joy-Con Toolkit
zh_cn: Joy-Con 工具箱

source: Refresh controllers
zh_cn: 刷新控制器

# NavOverview.Content
source: Overview
zh_cn: 概览

# NavColors.Content
source: Colors & SPI
zh_cn: 颜色与 SPI

# NavCalibration.Content
source: Calibration
zh_cn: 校准

# NavRumble.Content
source: HD Rumble
zh_cn: HD 震动

# NavInput.Content
source: Input test
zh_cn: 输入测试

# NavIr.Content
source: IR camera
zh_cn: 红外摄像头

# NavDiagnostics.Content
source: Diagnostics
zh_cn: 诊断

# FooterSession.Text
source: Protected writes
zh_cn: 受保护写入

# OverviewHeader.Text
source: Controller overview
zh_cn: 控制器概览

# ActiveControllerLabel.Text
source: ACTIVE CONTROLLER
zh_cn: 当前控制器

# ConnectionLabel.Text
source: CONNECTION
zh_cn: 连接方式

# ConnectionValue.Text
source: Bluetooth / USB HID
zh_cn: 蓝牙 / USB HID

# SessionLabel.Text
source: SESSION
zh_cn: 会话状态

# SessionValue.Text
source: Verified operations
zh_cn: 校验式操作

# FirmwareLabel.Text
source: FIRMWARE
zh_cn: 固件版本

# BatteryLabel.Text
source: BATTERY
zh_cn: 电池

# NotRead.Text
source: Not read
zh_cn: 尚未读取

# ProtectedSession.Text
source: Write protection
zh_cn: 写入保护

# SpiWrites.Text
source: SPI writes
zh_cn: SPI 写入

# CalibrationWrites.Text
source: Calibration writes
zh_cn: 校准写入

# Off.Text
source: Off
zh_cn: 关闭

# ColorWriteGuard.Text
source: Confirmation required
zh_cn: 需要确认

# CalibrationWriteGuard.Text
source: Read verification required
zh_cn: 需要读取验证

# NoActiveTasks.Text
source: No active tasks
zh_cn: 没有正在运行的任务

# WaitingOperation.Text
source: Waiting for an operation.
zh_cn: 等待操作。

# Idle.Text
source: Idle
zh_cn: 空闲

source: Ready
zh_cn: 就绪

source: Empty slot
zh_cn: 空插槽

source: No controller detected
zh_cn: 未检测到控制器

source: Disconnected
zh_cn: 未连接

source: Connected
zh_cn: 已连接

# SlotFormat
source: SLOT {0}
zh_cn: 插槽 {0}

source: No controller selected
zh_cn: 未选择控制器

# ConnectThenRefresh
source: Connect a controller, then refresh.
zh_cn: 连接控制器后刷新。

# ScanningControllers
source: Scanning for controllers...
zh_cn: 正在扫描控制器...

source: No controllers detected
zh_cn: 未检测到控制器

# ControllersConnectedFormat
source: {0} controllers connected
zh_cn: 已连接 {0} 个控制器

# OneControllerConnected
source: 1 controller connected
zh_cn: 已连接 1 个控制器

source: Controller scan cancelled
zh_cn: 已取消控制器扫描

# SelectedControllerFormat
source: Selected {0}
zh_cn: 已选择 {0}

# BridgeUnavailable
source: Native device bridge is unavailable
zh_cn: 原生设备桥接不可用

# BridgeArchitectureMismatch
source: Native device bridge architecture does not match
zh_cn: 原生设备桥接的架构不匹配

# BridgeIncompatible
source: Native device bridge is incompatible
zh_cn: 原生设备桥接版本不兼容

source: Controller scan failed
zh_cn: 控制器扫描失败

# SerialUnavailable
source: Serial number unavailable
zh_cn: 无法读取序列号

source: Nintendo controller
zh_cn: 任天堂控制器

# NotReadValue
source: Not read
zh_cn: 尚未读取

# TemperatureFormat
source: {0:F1} °C
zh_cn: {0:F1} ℃

# MacLabel.Text
source: MAC ADDRESS
zh_cn: MAC 地址

# TemperatureLabel.Text
source: TEMPERATURE
zh_cn: 温度

# SelectControllerFirst
source: Select a connected controller first
zh_cn: 请先选择已连接的控制器

source: Working...
zh_cn: 正在执行...

# CancelOperation
source: Cancel current operation
zh_cn: 取消当前操作

# OperationCancelling
source: Cancelling current operation...
zh_cn: 正在取消当前操作...

source: Operation cancelled
zh_cn: 操作已取消

# IdentifySucceeded
source: Identification vibration sent
zh_cn: 已发送识别震动

# ColorsWritten
source: Controller colors written and verified
zh_cn: 控制器颜色已写入并通过回读校验

source: Reading SPI...
zh_cn: 正在读取 SPI...

# SpiReadSucceededFormat
source: Read {0} SPI bytes
zh_cn: 已读取 {0} 字节 SPI 数据

# OperationFailedFormat
source: Operation failed: {0}
zh_cn: 操作失败：{0}

# NativeOperationFailedFormat
source: Device returned error {0}
zh_cn: 设备返回错误 {0}

source: Identify controller
zh_cn: 识别控制器

# ColorsHeader.Text
source: Colors & SPI
zh_cn: 颜色与 SPI

# ColorEditorHeader.Text
source: Controller colors
zh_cn: 控制器颜色

# ColorTarget.Header
source: Color target
zh_cn: 颜色位置

# ColorBody.Content
source: Body
zh_cn: 外壳

# ColorButtons.Content
source: Buttons
zh_cn: 按键

# ColorLeftGrip.Content
source: Left grip
zh_cn: 左握把

# ColorRightGrip.Content
source: Right grip
zh_cn: 右握把

# ColorHex.Header
source: Hex color
zh_cn: 十六进制颜色

# ReloadColors.Content
source: Reload
zh_cn: 重新读取

# ReloadColorsTooltip
source: Reload colors from controller
zh_cn: 从控制器重新读取颜色

# WriteColors.Content
source: Write colors
zh_cn: 写入颜色

# ConfirmColorWriteTitle
source: Write controller colors?
zh_cn: 写入控制器颜色？

# ConfirmColorWriteLine1
source: The current color values will be written to controller SPI.
zh_cn: 当前颜色值将写入控制器的 SPI。

# ConfirmColorWriteLine2
source: Create an SPI backup before changing hardware data.
zh_cn: 修改硬件数据前，请先创建 SPI 备份。

source: Continue
zh_cn: 继续

source: Cancel
zh_cn: 取消

# SpiToolsHeader.Text
source: SPI reader
zh_cn: SPI 读取器

# SpiAddress.Header
source: Address
zh_cn: 地址

# SpiLength.Header
source: Length
zh_cn: 长度

# ReadSpi.Content
source: Read
zh_cn: 读取

# SpiOutput.Header
source: Hex output
zh_cn: 十六进制输出

# SpiBackupHeader.Text
source: SPI backup and restore
zh_cn: SPI 备份与恢复

# CreateSpiBackup.Content
source: Create backup
zh_cn: 创建备份

# LoadSpiBackup.Content
source: Load backup
zh_cn: 加载备份

# RestoreScope.Header
source: Restore scope
zh_cn: 恢复范围

# RestoreColors.Content
source: Colors
zh_cn: 颜色

# RestoreSerial.Content
source: Serial number
zh_cn: 序列号

# RestoreCalibration.Content
source: User calibration
zh_cn: 用户校准

# RestoreFull.Content
source: Full safe restore
zh_cn: 完整安全恢复

# SerialNumber.Header
source: New serial number
zh_cn: 新序列号

# WriteSerial.Content
source: Write serial
zh_cn: 写入序列号

# RestoreBackup.Content
source: Restore selected scope
zh_cn: 恢复所选范围

# SpiBackupDisclaimer.Text
source: Only same-product, same-controller backups with a matching SHA-256 sidecar can be restored. Full restore does not reboot or change pairing state.
zh_cn: 只有同产品、同控制器且 SHA-256 伴随文件匹配的备份才能恢复。完整恢复不会重启控制器或修改配对状态。

# SpiBackupNotLoaded
source: No backup loaded
zh_cn: 未加载备份

source: checksum verified
zh_cn: 校验和已验证

# ChecksumMissing
source: checksum sidecar missing
zh_cn: 缺少校验和伴随文件

# SpiBackupChecksumMissing
source: A SHA-256 sidecar is required before restoring a backup
zh_cn: 恢复备份前必须存在 SHA-256 伴随文件

# SpiBackupSizeInvalid
source: Backup must be exactly 512 KiB
zh_cn: 备份必须正好为 512 KiB

# SpiBackupProductMismatch
source: Backup controller type does not match the selected controller
zh_cn: 备份控制器类型与所选控制器不匹配

# SpiBackupControllerMismatch
source: Backup Bluetooth identity does not match the selected controller
zh_cn: 备份中的蓝牙身份与所选控制器不匹配

# SpiBackupChecksumInvalid
source: Backup checksum does not match its sidecar
zh_cn: 备份校验和与伴随文件不匹配

# SpiBackupReady
source: Verified backup ready
zh_cn: 已准备好经过验证的备份

# SpiBackupVerificationFailed
source: SPI backup verification failed while reading
zh_cn: 读取过程中 SPI 备份校验失败

# SpiBackupCreating
source: Creating and verifying SPI backup...
zh_cn: 正在创建并校验 SPI 备份...

# SpiBackupCreated
source: SPI backup created and verified
zh_cn: SPI 备份已创建并校验

# SpiRestoreWriting
source: Writing and verifying SPI restore...
zh_cn: 正在写入并校验 SPI 恢复数据...

# SpiRestoreCompleted
source: SPI restore completed and verified
zh_cn: SPI 恢复已完成并校验

# ConfirmSpiRestoreTitle
source: Restore SPI data?
zh_cn: 恢复 SPI 数据？

# SpiRestoreWarningLine1
source: Selected values will be written to controller SPI and read back for verification.
zh_cn: 所选数据将写入控制器 SPI，并在写入后回读校验。

# SpiRestoreFullWarningLine2
source: Full restore replaces factory/user configuration ranges and erases the internal serial backup area. Do not disconnect the controller.
zh_cn: 完整恢复会替换工厂/用户配置区域，并擦除内部序列号备份区。请勿断开控制器。

# SpiRestoreWarningLine2
source: Incorrect data can make the controller unusable until a known-good backup is restored.
zh_cn: 错误数据可能导致控制器无法使用，直到恢复已知良好备份。

# ConfirmSerialWriteTitle
source: Write serial number?
zh_cn: 写入序列号？

# SerialWriteWarning
source: This changes the controller serial number. Create and keep a verified SPI backup first.
zh_cn: 这会修改控制器序列号，请先创建并保存经过验证的 SPI 备份。

# SerialNumberInvalid
source: Use 1-15 printable ASCII characters for the serial number
zh_cn: 序列号必须为 1 到 15 个可打印 ASCII 字符

# SerialNumberProUnsupported
source: Serial number writing is not supported for Pro Controller
zh_cn: Pro Controller 不支持写入序列号

# SerialNumberWritten
source: Serial number written and verified
zh_cn: 序列号已写入并校验

# InvalidSpiAddress
source: Enter a hexadecimal SPI address from 00000 to 7FFFF
zh_cn: 请输入 00000 到 7FFFF 范围内的十六进制 SPI 地址

# SettingsHeader.Text
source: Settings
zh_cn: 设置

# LanguageHeader.Text
source: Interface language
zh_cn: 界面语言

# LanguagePicker.Header
source: Language
zh_cn: 语言

# LanguageSystem.Content
source: Use system language
zh_cn: 跟随系统

# ApplyLanguage.Content
source: Apply and restart
zh_cn: 应用并重启

# RestartFailed
source: The application could not restart automatically
zh_cn: 应用无法自动重启

# CalibrationHeader.Text
source: Calibration
zh_cn: 校准

# ReadCalibration.Content
source: Read calibration
zh_cn: 读取校准

# LeftStickHeader.Text
source: Left stick user calibration
zh_cn: 左摇杆用户校准

# RightStickHeader.Text
source: Right stick user calibration
zh_cn: 右摇杆用户校准

# Minimum.Text
source: Minimum
zh_cn: 最小值

# Center.Text
source: Center
zh_cn: 中心值

# Maximum.Text
source: Maximum
zh_cn: 最大值

# SensorHeader.Text
source: 6-axis user calibration
zh_cn: 六轴传感器用户校准

# Accelerometer.Text
source: Accel
zh_cn: 加速度计

# Gyroscope.Text
source: Gyro
zh_cn: 陀螺仪

# StickParametersHeader.Text
source: Stick device parameters
zh_cn: 摇杆设备参数

# Deadzone.Header
source: Main deadzone
zh_cn: 主摇杆死区

# RangeRatio.Header
source: Main range ratio
zh_cn: 主摇杆范围比

# SecondDeadzone.Header
source: Right deadzone
zh_cn: 右摇杆死区

# SecondRangeRatio.Header
source: Right range ratio
zh_cn: 右摇杆范围比

# WriteParameters.Content
source: Write parameters
zh_cn: 写入设备参数

# WriteCalibration.Content
source: Write calibration
zh_cn: 写入校准

source: Enabled
zh_cn: 启用

source: Disabled
zh_cn: 禁用

# CalibrationNotRead
source: Read and verify the selected controller before writing.
zh_cn: 写入前请先读取并验证所选控制器。

# CalibrationReadFailed
source: Calibration data could not be read completely. Writing remains disabled.
zh_cn: 未能完整读取校准数据，写入仍保持禁用。

# CalibrationReady
source: Calibration data is verified for the selected controller.
zh_cn: 校准数据已与所选控制器身份完成验证。

# CalibrationIdentityChanged
source: The selected controller changed. Read calibration again before writing.
zh_cn: 所选控制器已改变，写入前请重新读取校准。

# CalibrationOrderInvalid
source: Each enabled stick axis must satisfy minimum < center < maximum.
zh_cn: 每个已启用的摇杆轴必须满足：最小值 < 中心值 < 最大值。

# ConfirmCalibrationTitle
source: Write user calibration?
zh_cn: 写入用户校准？

# ConfirmCalibrationLine1
source: The displayed user calibration will be written to controller SPI.
zh_cn: 界面中的用户校准值将写入控制器 SPI。

# ConfirmCalibrationLine2
source: Incorrect values can make the controller unusable until calibration is restored.
zh_cn: 错误数值可能导致控制器在恢复校准前无法正常使用。

# ConfirmParametersTitle
source: Write stick device parameters?
zh_cn: 写入摇杆设备参数？

# ConfirmParametersLine1
source: These values normally come from the factory.
zh_cn: 这些数值通常由工厂写入。

# ConfirmParametersLine2
source: Only continue when you have verified replacement values.
zh_cn: 仅在确认替换数值正确时继续。

# CalibrationWritten
source: User calibration written and verified
zh_cn: 用户校准已写入并通过回读校验

# ParametersWritten
source: Stick parameters written and verified
zh_cn: 摇杆参数已写入并通过回读校验

# CalibrationWriteFailed
source: Calibration write failed. Read the controller again before retrying.
zh_cn: 校准写入失败，请重新读取控制器后再试。

# RumbleHeader.Text
source: HD Rumble
zh_cn: HD 震动

# NoRumbleFile.Text
source: No file loaded
zh_cn: 未加载文件

# RawRumbleFormat.Text
source: Raw HD Rumble · .jcvib
zh_cn: 原始 HD 震动 · .jcvib

# BinaryRumbleFormat.Text
source: Binary HD Rumble · .bnvib
zh_cn: 二进制 HD 震动 · .bnvib

# LoopRumbleFormat.Text
source: Looping binary HD Rumble · .bnvib
zh_cn: 循环二进制 HD 震动 · .bnvib

# LoopWaitRumbleFormat.Text
source: Looping/waiting binary HD Rumble · .bnvib
zh_cn: 循环/等待二进制 HD 震动 · .bnvib

# LoadRumble.Content
source: Load
zh_cn: 加载

# RumbleLowFrequency.Text
source: Low frequency
zh_cn: 低频

# RumbleHighFrequency.Text
source: High frequency
zh_cn: 高频

# RumbleEqualizerHeader.Text
source: Equalizer
zh_cn: 均衡器

# RumbleAmplitude.Text
source: Amplitude
zh_cn: 幅度

# RumblePitch.Text
source: Frequency
zh_cn: 频率

# RumbleLoopCount.Header
source: Extra loop cycles
zh_cn: 额外循环次数

# RumbleConvert.Content
source: Apply equalizer
zh_cn: 应用均衡器

# RumbleConvertReady
source: Binary rumble will be converted with the current equalizer on play
zh_cn: 播放二进制震动时会按当前均衡器转换

# PlaybackStatus.Text
source: PLAYBACK
zh_cn: 播放状态

# RumbleReady.Text
source: Ready
zh_cn: 就绪

# Play.Content
source: Play
zh_cn: 播放

# Stop.Content
source: Stop
zh_cn: 停止

# InvalidRumbleFile
source: Invalid or truncated RRAW file
zh_cn: RRAW 文件无效或数据不完整

# RumbleDetailsFormat
source: {0} samples · {1} ms · {2:F2} s
zh_cn: {0} 个采样 · {1} 毫秒 · {2:F2} 秒

# RumblePlaying
source: Playing HD Rumble...
zh_cn: 正在播放 HD 震动...

# RumbleStopping
source: Stopping playback...
zh_cn: 正在停止播放...

# RumbleCompleted
source: Playback completed
zh_cn: 播放完成

# RumbleStopped
source: Playback stopped
zh_cn: 播放已停止

# ControllerBusy
source: The selected controller is busy
zh_cn: 所选控制器正忙

# InputHeader.Text
source: Input test
zh_cn: 输入测试

# ReadInput.Content
source: Read input
zh_cn: 读取输入

# StartInputStream.Content
source: Start input stream
zh_cn: 开始连续读取

# StopInputStream.Content
source: Stop input stream
zh_cn: 停止连续读取

# InputStatusHeader.Text
source: Controller state
zh_cn: 控制器状态

# ButtonVisualizerHeader.Text
source: Button state
zh_cn: 按键状态

# ButtonMinus
source: Minus
zh_cn: 减号

# ButtonPlus
source: Plus
zh_cn: 加号

# ButtonLeftStick
source: L Stick
zh_cn: 左摇杆键

# ButtonRightStick
source: R Stick
zh_cn: 右摇杆键

# ButtonUp
source: Up
zh_cn: 上

# ButtonDown
source: Down
zh_cn: 下

# ButtonLeft
source: Left
zh_cn: 左

# ButtonRight
source: Right
zh_cn: 右

# ButtonCapture
source: Capture
zh_cn: 截屏

# ButtonsLabel.Text
source: BUTTONS
zh_cn: 按键

# ChargingLabel.Text
source: CHARGING
zh_cn: 充电状态

# SticksHeader.Text
source: Analog sticks
zh_cn: 模拟摇杆

# LeftStick.Text
source: Left stick
zh_cn: 左摇杆

# RightStick.Text
source: Right stick
zh_cn: 右摇杆

# MotionHeader.Text
source: Motion sensors · raw values
zh_cn: 运动传感器 · 原始数值

# ReadingInput
source: Reading controller input...
zh_cn: 正在读取控制器输入...

# InputReadSucceeded
source: Controller input updated
zh_cn: 控制器输入已更新

# InputStreamStarted
source: Live controller input is running
zh_cn: 正在连续读取控制器输入

# InputStreamStopping
source: Stopping live controller input...
zh_cn: 正在停止连续读取...

# InputStreamStopped
source: Live controller input stopped
zh_cn: 已停止连续读取控制器输入

source: Yes
zh_cn: 是

source: No
zh_cn: 否

# IrHeader.Text
source: IR camera
zh_cn: 红外摄像头

# CaptureIr.Content
source: Capture
zh_cn: 拍照

# SaveIrImage.Content
source: Save
zh_cn: 保存

# StartIrStream.Content
source: Start stream
zh_cn: 开始视频流

# StopIrStream.Content
source: Stop stream
zh_cn: 停止视频流

# IrPreviewEmpty.Text
source: No IR frame captured
zh_cn: 尚未捕获红外图像

# IrPreviewAutomationName
source: IR camera preview
zh_cn: 红外摄像头预览

# IrSettingsHeader.Text
source: Camera settings
zh_cn: 摄像头设置

# IrResolution.Header
source: Resolution
zh_cn: 分辨率

# IrExposure.Header
source: Exposure (µs)
zh_cn: 曝光时间（微秒）

# IrGain.Text
source: Digital gain
zh_cn: 数字增益

# IrColorMode.Header
source: Display mode
zh_cn: 显示模式

# IrGrayscale.Content
source: Grayscale
zh_cn: 灰度

# IrNightVision.Content
source: Night vision
zh_cn: 夜视

# IrInfrared.Content
source: Infrared
zh_cn: 红外

# IrLeds.Header
source: IR illumination
zh_cn: 红外补光

# IrExternalFilter.Header
source: External light filter
zh_cn: 外部光线滤波

# IrDenoise.Header
source: Denoise
zh_cn: 降噪

# IrFlip.Header
source: Flip horizontally
zh_cn: 水平翻转

# IrFrameStatsHeader.Text
source: Frame statistics
zh_cn: 帧统计

# IrNoFrameStats.Text
source: Capture a frame to view sensor statistics.
zh_cn: 捕获图像后显示传感器统计数据。

# IrStatsFormat
source: Frame {0} · {1} × {2} · average {3}/255 · white pixels {4} · ambient pixels {5}
zh_cn: 第 {0} 帧 · {1} × {2} · 平均亮度 {3}/255 · 白色像素 {4} · 环境光像素 {5}

# IrRequiresRightJoyCon
source: The IR camera requires Joy-Con (R)
zh_cn: 红外摄像头仅适用于 Joy-Con (R)

# IrCapturing
source: Capturing an IR frame...
zh_cn: 正在捕获红外图像...

# IrStreaming
source: IR camera stream is running
zh_cn: 红外摄像头视频流正在运行

# IrFrameReceivedFormat
source: IR frame {0} received
zh_cn: 已接收红外图像第 {0} 帧

# IrCaptureCompleted
source: IR frame captured
zh_cn: 红外图像捕获完成

# IrStopping
source: Stopping IR camera...
zh_cn: 正在停止红外摄像头...

# IrStopped
source: IR camera stopped
zh_cn: 红外摄像头已停止

# NfcHeader.Text
source: NFC tag reader
zh_cn: NFC 标签读取器

# StartNfcScan.Content
source: Scan tag
zh_cn: 扫描标签

# StopNfcScan.Content
source: Stop scan
zh_cn: 停止扫描

# NfcTagHeader.Text
source: Detected tag
zh_cn: 检测到的标签

# NfcTypeLabel.Text
source: Tag type
zh_cn: 标签类型

# NfcParsedContentHeader.Text
source: Parsed content
zh_cn: 解析内容

# NfcRawContentHeader.Text
source: Raw NTAG pages
zh_cn: NTAG 原始页数据

# NfcUnknownTag
source: Unknown tag
zh_cn: 未知标签

# NfcUriRecord
source: NDEF URI record
zh_cn: NDEF URI 记录

# NfcTextRecord
source: NDEF text record
zh_cn: NDEF 文本记录

# NfcNoNdefContent
source: No supported NDEF text or URI record was found
zh_cn: 未找到支持的 NDEF 文本或 URI 记录

# NfcMifareUnsupported
source: MIFARE content reading is not supported
zh_cn: 暂不支持读取 MIFARE 标签内容

# NfcRequiresRightJoyConOrPro
source: NFC requires Joy-Con (R) or Pro Controller
zh_cn: NFC 仅适用于 Joy-Con (R) 或 Pro Controller

# NfcScanning
source: Waiting for an NFC tag...
zh_cn: 正在等待 NFC 标签...

source: NFC tag read
zh_cn: NFC 标签读取完成

# NfcStopping
source: Stopping NFC scan...
zh_cn: 正在停止 NFC 扫描...

# NfcStopped
source: NFC scan stopped
zh_cn: NFC 扫描已停止

# DiagnosticsHeader.Text
source: Diagnostics
zh_cn: 诊断

# DiagnosticCommandHeader.Text
source: Safe command console
zh_cn: 安全命令控制台

# DiagnosticMode.Header
source: Command class
zh_cn: 命令类别

# DiagnosticModeDebug.Content
source: Debug allowlist
zh_cn: Debug 白名单

# DiagnosticModeInternal.Content
source: Internal allowlist
zh_cn: 内部命令白名单

# DiagnosticCommand.Header
source: Report
zh_cn: 报告类型

# DiagnosticRumble.Header
source: Rumble (4 bytes)
zh_cn: 震动（4 字节）

# DiagnosticSubcommand.Header
source: Subcommand
zh_cn: 子命令

# DiagnosticArguments.Header
source: Arguments (hex)
zh_cn: 参数（十六进制）

# SendDiagnostic.Content
source: Send
zh_cn: 发送

# DiagnosticReply.Header
source: Reply
zh_cn: 回复

# InternalPresetsHeader.Text
source: Internal actions
zh_cn: 内部操作

# InternalPresetsWarning.Text
source: These actions can change pairing or shipment state. Each action requires confirmation.
zh_cn: 这些操作可能修改配对或出货状态，每项操作都需要确认。

# SetShipment.Content
source: Set shipment mode
zh_cn: 设置出货模式

# ClearPairing.Content
source: Clear pairing data
zh_cn: 清除配对数据

# RebootPairing.Content
source: Reboot into pairing
zh_cn: 重启并进入配对

# ConfirmInternalCommandTitle
source: Run internal controller action?
zh_cn: 运行内部控制器操作？

# SetShipmentConfirm
source: This writes the shipment-state command to the selected controller.
zh_cn: 这会向所选控制器写入出货状态命令。

# ClearPairingConfirm
source: This clears controller pairing data and requires pairing again.
zh_cn: 这会清除控制器配对数据，之后需要重新配对。

# RebootPairingConfirm
source: This reboots the selected controller and requests pairing mode.
zh_cn: 这会重启所选控制器并请求进入配对模式。

# DiagnosticEnvironmentFormat
source: Process {0} · Windows {1} · effective DPI {2} · base {3}
zh_cn: 进程 {0} · Windows {1} · 有效 DPI {2} · 基目录 {3}

# EnvironmentHeader.Text
source: Runtime environment
zh_cn: 运行环境

# DiagnosticSafetyNote.Text
source: Only commands in the native hardware-safe allowlist are accepted. Firmware-update, SPI-write, and arbitrary MCU payloads are rejected before HID output.
zh_cn: 只有原生硬件安全白名单中的命令会被接受。固件升级、SPI 写入和任意 MCU 负载会在 HID 输出前被拒绝。

# DiagnosticByteInvalid
source: Report and subcommand must be one hexadecimal byte
zh_cn: 报告类型和子命令必须是一个十六进制字节

# DiagnosticHexInvalid
source: Use space-separated two-digit hexadecimal bytes within the allowed length
zh_cn: 请使用空格分隔的两位十六进制字节，并控制在允许长度内

# DiagnosticAccepted
source: Diagnostic command accepted
zh_cn: 诊断命令已接受

source: Diagnostic reply received
zh_cn: 已收到诊断回复

# DiagnosticOperationFailedFormat
source: Diagnostic command failed ({0})
zh_cn: 诊断命令失败（{0}）

# DiagnosticSentLabel
source: Sent
zh_cn: 已发送

# DiagnosticReceivedLabel
source: Received
zh_cn: 已接收

# DiagnosticNoReply
source: No reply
zh_cn: 无回复

# DiagnosticReplyStateFormat
source: Matched: {0} · Accepted: {1}
zh_cn: 匹配：{0} · 接受：{1}

# RunHardwarePreflight.Content
source: Run hardware preflight
zh_cn: 运行硬件预检

# HardwarePreflightRunning
source: Running hardware preflight...
zh_cn: 正在运行硬件预检...

source: Hardware preflight passed
zh_cn: 硬件预检通过

# HardwarePreflightFailedFormat
source: Hardware preflight failed ({0}): {1}
zh_cn: 硬件预检失败（{0}）：{1}

# HardwarePreflightInputStep
source: controller input
zh_cn: 控制器输入

# HardwarePreflightSpiStep
source: SPI read
zh_cn: SPI 读取

# HardwarePreflightDiagnosticStep
source: safe diagnostic command
zh_cn: 安全诊断命令

# HardwarePreflightAllowlistStep
source: unsafe-command rejection
zh_cn: 不安全命令拒绝

# HardwarePreflightIrStep
source: IR camera start/stop
zh_cn: 红外摄像头启停

# HardwarePreflightNfcStep
source: NFC cancellation
zh_cn: NFC 取消

# FullRestoreFinalizing
source: Finalizing full restore...
zh_cn: 正在完成完整恢复...

# FullRestoreFinalized
source: Full restore finalization commands sent
zh_cn: 完整恢复收尾命令已发送

# FinalizeRestore.Content
source: Finalize: shipment + pairing reset + reboot
zh_cn: 完成收尾：出货 + 清配对 + 重启

# ConfirmFullRestoreFinalizeTitle
source: Finalize full restore?
zh_cn: 完成完整恢复收尾？

# FullRestoreFinalizeWarning
source: This sends the legacy internal sequence: set shipment state, clear pairing data, then reboot into pairing mode. The controller will need to be paired again.
zh_cn: 这会发送旧版内部命令序列：设置出货状态、清除配对数据，然后重启进入配对模式。控制器之后需要重新配对。
